-- phpMyAdmin SQL Dump
-- version 4.7.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3306
-- Generation Time: 2018-11-29 01:42:31
-- 服务器版本： 5.7.19
-- PHP Version: 7.0.23

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `hema`
--

-- --------------------------------------------------------

--
-- 表的结构 `category`
--

DROP TABLE IF EXISTS `category`;
CREATE TABLE IF NOT EXISTS `category` (
  `id` int(10) NOT NULL AUTO_INCREMENT COMMENT '标示',
  `name` varchar(20) NOT NULL COMMENT '分类名',
  `level` int(10) NOT NULL COMMENT '水平',
  `sort` int(10) NOT NULL COMMENT '序号',
  `pic` varchar(500) DEFAULT NULL COMMENT '图片',
  `parent_id` int(10) NOT NULL COMMENT '上级ID',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=112 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `category`
--

INSERT INTO `category` (`id`, `name`, `level`, `sort`, `pic`, `parent_id`) VALUES
(1, '新鲜水果', 1, 1, 'uploads/20181026\\b541dbf7bc9c7652528e15b09ea126af.png', 0),
(2, '时令蔬菜', 1, 2, 'uploads/20181026\\4aec7232cf3d55b6238baee206eed8bd.png', 0),
(3, '肉禽蛋品', 1, 3, 'uploads/20181026\\8d2b6415030180cd1937a867ce179bbf.png', 0),
(4, '海鲜水产', 1, 4, 'uploads/20181026\\a74dea563aa97e2fb87284520f69c537.png', 0),
(5, '乳品烘焙', 1, 5, 'uploads/20181026\\053eb74ea6dedeb4d68ec4b879a6d998.png', 0),
(6, '餐饮熟食', 1, 6, 'uploads/20181026\\76b39b702545a35b70bab0757a88ab58.png', 0),
(7, '面点火锅', 1, 7, 'uploads/20181026\\983543ffe6c595025300228e6a8e92bf.png', 0),
(8, '休闲零食', 1, 8, 'uploads/20181026\\d9006632c4f23b990207d90472c26f02.png', 0),
(9, '酒水饮料', 1, 9, 'uploads/20181026\\6eefc66d905ff9cb6b8ba74557aba7eb.png', 0),
(10, '粮油百货', 1, 10, 'uploads/20181026\\5cc6b729a29dcfccd3b034f273d2c52a.png', 0),
(11, '热带水果', 2, 11, NULL, 1),
(12, '柑橘橙柚', 2, 12, NULL, 1),
(13, '奇异果', 2, 13, NULL, 1),
(14, '提子/葡萄', 2, 14, NULL, 1),
(15, '车厘子/莓果', 2, 15, NULL, 1),
(16, '苹果/梨', 2, 16, NULL, 1),
(17, '果切/果汁', 2, 17, NULL, 1),
(18, '西瓜/蜜瓜', 2, 18, NULL, 1),
(19, '桃杏李', 2, 19, NULL, 1),
(20, '礼盒类', 2, 20, NULL, 1),
(21, '绿叶菜', 2, 21, NULL, 2),
(22, '菌菇类', 2, 22, NULL, 2),
(23, '茄果/瓜果', 2, 23, NULL, 2),
(24, '根茎类', 2, 24, NULL, 2),
(25, '豆类/豆腐', 2, 25, NULL, 2),
(26, '调味/香料', 2, 26, NULL, 2),
(27, '沙拉菜', 2, 27, NULL, 2),
(28, '帝皇鲜', 2, 28, NULL, 3),
(29, '日日鲜', 2, 29, NULL, 3),
(30, '炖煮食材', 2, 30, NULL, 3),
(31, '火锅肉片', 2, 31, NULL, 3),
(32, '羊肉', 2, 32, NULL, 3),
(33, '牛肉', 2, 33, NULL, 3),
(34, '牛排', 2, 34, NULL, 3),
(35, '猪肉', 2, 35, NULL, 3),
(36, '蛋类', 2, 36, NULL, 3),
(37, '鸡鸭鹅', 2, 37, NULL, 3),
(38, '烧烤', 2, 38, NULL, 3),
(39, '大闸蟹', 2, 39, NULL, 4),
(40, '家常海鲜', 2, 40, NULL, 4),
(41, '帝皇鲜', 2, 41, NULL, 4),
(42, '三文鱼/鳕鱼', 2, 42, NULL, 4),
(43, '鱼', 2, 43, NULL, 4),
(44, '虾', 2, 44, NULL, 4),
(45, '贝', 2, 45, NULL, 4),
(46, '蟹', 2, 46, NULL, 4),
(47, '甲鱼/鱿鱼', 2, 47, NULL, 4),
(48, '生蚝/海参', 2, 48, NULL, 4),
(49, '海鲜礼盒', 2, 49, NULL, 4),
(50, '新鲜牛奶', 2, 50, NULL, 5),
(51, '酸奶/乳酸菌', 2, 51, NULL, 5),
(52, '冰淇淋', 2, 52, NULL, 5),
(53, '三明治/欧包', 2, 53, NULL, 5),
(54, '蛋糕点心', 2, 54, NULL, 5),
(55, '黄油奶酪', 2, 55, NULL, 5),
(56, '秋季甜品', 2, 56, NULL, 5),
(57, '果汁饮品', 2, 57, NULL, 5),
(58, '常温乳品', 2, 58, NULL, 5),
(59, '奶粉', 2, 59, NULL, 5),
(60, '中餐烧腊', 2, 60, NULL, 6),
(61, '烘焙饮品', 2, 61, NULL, 6),
(62, '日本料理', 2, 62, NULL, 6),
(63, '点心主食', 2, 63, NULL, 6),
(64, '烧烤小吃', 2, 64, NULL, 6),
(65, '卤味凉菜', 2, 65, NULL, 6),
(66, '海鲜大餐', 2, 66, NULL, 6),
(67, '轻食沙拉', 2, 67, NULL, 6),
(68, '盒马工坊', 2, 68, NULL, 6),
(69, '火锅食材', 2, 69, NULL, 7),
(70, '水饺混沌', 2, 70, NULL, 7),
(71, '包子点心', 2, 71, NULL, 7),
(72, '面条/拉面', 2, 72, NULL, 7),
(73, '年糕/汤圆', 2, 73, NULL, 7),
(74, '腌制肉/肠类', 2, 74, NULL, 7),
(75, '泡菜/手抓饼', 2, 75, NULL, 7),
(76, '冰淇淋', 2, 76, NULL, 7),
(77, '方便菜肴', 2, 77, NULL, 7),
(78, '时蔬/豆制品', 2, 78, NULL, 7),
(79, '河马工坊', 2, 79, NULL, 7),
(80, '饼干曲奇', 2, 80, NULL, 8),
(81, '营养牛奶', 2, 81, NULL, 8),
(82, '巧克力', 2, 82, NULL, 8),
(83, '麦片冲饮', 2, 83, NULL, 8),
(84, '肉片小食', 2, 84, NULL, 8),
(85, '薯片膨化', 2, 85, NULL, 8),
(86, '坚果炒货', 2, 86, NULL, 8),
(87, '蛋糕点心', 2, 87, NULL, 8),
(88, '果敢蜜饯', 2, 88, NULL, 8),
(89, '糖果果冻', 2, 89, NULL, 8),
(90, '白/黄酒', 2, 90, NULL, 9),
(91, '葡萄酒', 2, 91, NULL, 9),
(92, '饮水机', 2, 92, NULL, 9),
(93, '碳酸汽水', 2, 93, NULL, 9),
(94, '果/蔬汁', 2, 94, NULL, 9),
(95, '洋酒/日韩', 2, 95, NULL, 9),
(96, '咖啡茶饮', 2, 96, NULL, 9),
(97, '冲饮谷物', 2, 97, NULL, 9),
(98, '啤酒/预调', 2, 98, NULL, 9),
(99, '大米', 2, 99, NULL, 10),
(100, '食用油', 2, 100, NULL, 10),
(101, '个人洗护', 2, 101, NULL, 10),
(102, '纸制品', 2, 102, NULL, 10),
(103, '方便食品', 2, 103, NULL, 10),
(104, '南北干货', 2, 104, NULL, 10),
(105, '美妆护肤', 2, 105, NULL, 10),
(106, '五谷杂粮', 2, 106, NULL, 10),
(107, '调味汁', 2, 107, NULL, 10),
(108, '调味料', 2, 108, NULL, 10),
(109, '调味酱', 2, 109, NULL, 10),
(110, '家居清洁', 2, 110, NULL, 10),
(111, '衣物清洁', 2, 111, NULL, 10);

-- --------------------------------------------------------

--
-- 表的结构 `goods`
--

DROP TABLE IF EXISTS `goods`;
CREATE TABLE IF NOT EXISTS `goods` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `description` varchar(500) NOT NULL,
  `price` varchar(10) NOT NULL,
  `recommend` int(2) NOT NULL DEFAULT '0' COMMENT '买手力荐：0表示不推荐，1表示推荐',
  `hot_list` int(2) NOT NULL DEFAULT '0' COMMENT '热卖榜：0表示不推荐，1表示推荐',
  `holiday_preferences` int(2) NOT NULL DEFAULT '0' COMMENT '节日优惠：0表示不推荐，1表示推荐',
  `new_products` int(2) NOT NULL DEFAULT '0' COMMENT '新品：0表示不推荐，1表示推荐',
  `super_cost-effective` int(2) NOT NULL DEFAULT '0' COMMENT '超划算：0表示不推荐，1表示推荐',
  `cate_id` int(10) NOT NULL COMMENT '一级分类ID',
  `category_id` int(10) NOT NULL COMMENT '二级分类ID',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=30 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `goods`
--

INSERT INTO `goods` (`id`, `name`, `description`, `price`, `recommend`, `hot_list`, `holiday_preferences`, `new_products`, `super_cost-effective`, `cate_id`, `category_id`) VALUES
(1, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无---来自素有“江南桔乡”之美誉--无无无', '12.80', 1, 0, 0, 0, 0, 1, 11),
(2, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无---来自素有“江南桔乡”之美誉--无无无', '12.80', 1, 0, 0, 0, 0, 1, 12),
(3, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 1, 0, 0, 0, 0, 1, 11),
(4, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 1, 0, 0, 0, 0, 1, 13),
(5, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 1, 0, 0, 0, 0, 1, 12),
(6, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 1, 0, 0, 0, 1, 13),
(7, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 1, 0, 0, 0, 1, 11),
(8, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 1, 0, 0, 0, 1, 11),
(9, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 1, 0, 0, 0, 1, 12),
(10, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 0, 1, 0, 0, 1, 13),
(11, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 0, 1, 0, 0, 1, 12),
(12, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 0, 1, 0, 0, 1, 13),
(13, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 0, 1, 0, 0, 1, 15),
(14, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 0, 0, 1, 0, 1, 14),
(15, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 0, 0, 1, 0, 1, 13),
(16, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 0, 0, 1, 0, 1, 15),
(17, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 0, 0, 1, 0, 1, 13),
(18, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 0, 0, 0, 1, 1, 11),
(19, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 0, 0, 0, 1, 1, 12),
(20, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 0, 0, 0, 1, 1, 15),
(21, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 0, 0, 0, 1, 1, 14),
(22, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 0, 0, 0, 1, 1, 15),
(23, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 0, 0, 0, 1, 1, 14),
(24, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 1, 0, 0, 0, 0, 1, 13),
(25, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 1, 0, 0, 0, 1, 13),
(26, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 0, 1, 0, 0, 1, 13),
(27, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 0, 1, 0, 0, 1, 13),
(28, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 0, 0, 1, 0, 1, 13),
(29, '浙江临海涌泉蜜桔8个装', '来自素有“江南桔乡”之美誉--无无无', '12.80', 0, 0, 0, 1, 0, 1, 13);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
